{"meta":{"title":"Jelte, Just a guy with a hackers' mindset","subtitle":null,"description":null,"author":"Jelte Lagendijk","url":"http://blog.jeltelagendijk.nl"},"pages":[{"title":"progress","date":"2016-09-20T23:12:27.000Z","updated":"2017-11-01T03:29:21.365Z","comments":true,"path":"progress/index.html","permalink":"http://blog.jeltelagendijk.nl/progress/index.html","excerpt":"","text":""}],"posts":[{"title":"Machteloos","slug":"machteloos","date":"2016-09-17T20:16:29.000Z","updated":"2016-09-17T20:16:29.000Z","comments":true,"path":"2016/09/machteloos/","link":"","permalink":"http://blog.jeltelagendijk.nl/2016/09/machteloos/","excerpt":"Het is al lang geleden dat ik iets geblogd heb. Dit gedicht schreef ik toen een familielid in het ziekenhuis kwam te liggen. Hing voor mn gevoel aan een zijden draadje. Gelukkig is het goedgekomen. Dit gedicht komt uit het moment voor de operatie, midden in de nacht.","text":"Het is al lang geleden dat ik iets geblogd heb. Dit gedicht schreef ik toen een familielid in het ziekenhuis kwam te liggen. Hing voor mn gevoel aan een zijden draadje. Gelukkig is het goedgekomen. Dit gedicht komt uit het moment voor de operatie, midden in de nacht. Daar sta je danWachtend op de toon“Ze is heel erg ziek”Snikkend door de telefoon Daar sta je danMet een steen op je maagZal ze er straks nog zijn?Chaotisch onoplosbare vraag Daar ga je danMet een rotvaart over straatElke minuut afvragendBen ik nu niet te laat Daar lig je danDoodziek en vol pijnMe groot houdend en tederWil ik er voor je zijn De machteloze gevoelensMaken een woede in me losMet lege handen naast het bedWaarom ben jij nou de klos? Dit is toch niet eerlijk?Zegt het boze in mijWachten op de volgende stapWanneer is de pijn voorbij? Je kijkt nog een keertjeJe staat er verdrietig en boosDe kamer uitgeredenBlijf je achter, machteloos","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"},{"name":"poem","slug":"poem","permalink":"http://blog.jeltelagendijk.nl/tags/poem/"}],"keywords":[]},{"title":"Reading page variables in Google Chrome extensions","slug":"reading-page-variables-in-google-chrome-extensions","date":"2015-06-06T13:37:51.000Z","updated":"2015-06-06T13:37:51.000Z","comments":true,"path":"2015/06/reading-page-variables-in-google-chrome-extensions/","link":"","permalink":"http://blog.jeltelagendijk.nl/2015/06/reading-page-variables-in-google-chrome-extensions/","excerpt":"Recently I have been developing two Chrome Extensions for a contractor. This is a fun way to learn new things, especially about the API used. For one of those Extensions I needed to perform a few checks on a page, reading variables in the page. There is only one problem: The way Chrome Extensions work is that their contentscripts (either defined by the manifest.json or as an executed script) are running in their own world. I found a workaround that I hosted on Github","text":"Recently I have been developing two Chrome Extensions for a contractor. This is a fun way to learn new things, especially about the API used. For one of those Extensions I needed to perform a few checks on a page, reading variables in the page. There is only one problem: The way Chrome Extensions work is that their contentscripts (either defined by the manifest.json or as an executed script) are running in their own world. I found a workaround that I hosted on Github popup-snippet.js is a snippet of the popup script. The function performTests will first query chrome for the current Tab that is opened. Next, on the current tab it injects variable-checker.js and execute it. The variable checker will inject dynamic scripts in the page that are able to read the variables. As you can see the variable-checker is a simple script that actually does a very ugly thing, but it works. It reads content of the dynamically generated divs, which contains the output of the dynamically generated scripts. These scripts do have access to the page variables (in this case it tries to read the version of jQuery and window.et) If it is able to read a variable, it will return the content of it. If not, it will return null.","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Blog moved to Github. Welcome Hexo","slug":"blog-moved-to-github-welcome-hexo","date":"2015-03-10T00:09:46.000Z","updated":"2015-03-10T00:09:46.000Z","comments":true,"path":"2015/03/blog-moved-to-github-welcome-hexo/","link":"","permalink":"http://blog.jeltelagendijk.nl/2015/03/blog-moved-to-github-welcome-hexo/","excerpt":"Finally getting something done with my blog. It has been about half a year since I wrote my last piece. I was a bit done with blogging, actually. No further input, no more poems and just too busy doing other things. Well, today I decided to move my blog to Github. Why? Because ever since I started working as a front-end developer, I have fallen in love with just plain old HTML again. And so, what better way to do than to just move my website to a static one?","text":"Finally getting something done with my blog. It has been about half a year since I wrote my last piece. I was a bit done with blogging, actually. No further input, no more poems and just too busy doing other things. Well, today I decided to move my blog to Github. Why? Because ever since I started working as a front-end developer, I have fallen in love with just plain old HTML again. And so, what better way to do than to just move my website to a static one? So I still need some tweaking, but I have finally migrated all my old posts from Wordpress to Hexo. This was a bit of a pain in the ass, actually. Especially because I needed to redo all my posts in Markdown. Yes, the text was already there, but I had to do the formatting again. To make sure Google would index my old blogposts again, I had to write some .htaccess rewrites, so this will probably be picked up in a week or so. Hopefully the SEO won’t suck, but then again, my blog isn’t really active or pretty much interesting for anyone to read… What’s next? Have to update my Hexo to 3.0 (this is still on the old one) Tweak the layout a bit more, have some issues with the formatting of paragraphs Done. Write new content Oh yeah, I started a new job. So it will be as hard as it was to write content. Maybe doing some poems again. We all love poems.","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Gedicht: De lift","slug":"de-lift","date":"2014-07-01T18:08:44.000Z","updated":"2014-07-01T18:08:44.000Z","comments":true,"path":"2014/07/de-lift/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/07/de-lift/","excerpt":"Af en toe schrijf je ook wel eens gedichten die… nouja… gebaseerd zijn op fantasie. Of was dit toch de realiteit?","text":"Af en toe schrijf je ook wel eens gedichten die… nouja… gebaseerd zijn op fantasie. Of was dit toch de realiteit? Onze blikken kruisen in de liftMijn gevoel zegt maar 1 dingHelaas zijn we nog niet alleenEen aanraking, subtiele tinteling De passagier stapt uitAlvorens de liftdeuren sluitenDruk ik je ruw tegen de wandDierlijk, impulsief niet te stuiten Mijn mond ontmoet de jouweSmeltend hart gaat tekeerVluchtige blikken in mijn ogenDit moment smaakt naar meer Mijn stoppels schuren in je nekHanden omvatten daadkrachtig je zijGeen woord en toch weet ik zekerDit korte moment ben je van mij De liftdeur gaat openIk stap uit ergens op drieAchterom kijkend vertwijfeldWas dit realiteit of wilde fantasie?","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"},{"name":"poem","slug":"poem","permalink":"http://blog.jeltelagendijk.nl/tags/poem/"}],"keywords":[]},{"title":"Poem: The mountain","slug":"poem-mountain","date":"2014-06-30T19:00:29.000Z","updated":"2014-06-30T19:00:29.000Z","comments":true,"path":"2014/06/poem-mountain/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/06/poem-mountain/","excerpt":"Just my line of thoughts when helping a friend or loved one.","text":"Just my line of thoughts when helping a friend or loved one. Whenever the mountain seems endlessly highThe summit, far up there in the skyYour legs are tired, your feet are soreThinking you can’t take it anymore Stop for a second, take a moment of restThat fictional mountain puts your mind to the testClose your eyes and visualize the wayYou can’t reach the summit, just in one day I am right behind you, pointing at the cloudsWithout fear, without a stream of doubtsYou can’t fall, neither can IAll of a sudden, that mountain isn’t that high Take my hand, feel the connection, positive energyWe climb steady together, you and meNo obstacle that can make me stopLet’s beat the mountain, right to the top!","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"},{"name":"poem","slug":"poem","permalink":"http://blog.jeltelagendijk.nl/tags/poem/"}],"keywords":[]},{"title":"Ik ben een denker","slug":"ik-ben-een-denker","date":"2014-06-26T10:26:21.000Z","updated":"2014-06-26T10:26:21.000Z","comments":true,"path":"2014/06/ik-ben-een-denker/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/06/ik-ben-een-denker/","excerpt":"Het is inmiddels een uur of half een in de nacht, verwikkeld in een diepgaand gesprek. Het is de enige persoon die mij ongevraagd advies mag geven. Sterker nog, ik verwacht het. Het is een gewoonte, een gedachtewisseling die op een dieper niveau gaat dan ik met menigeen heb. “Joh, ik denk gewoon veel teveel na over dit ‘probleem’. Mijn hoofd maakt overuren. Het verschil tussen gevoel en ratio is ver te zoeken, er is een onbalans. Ik trek conclusies die nergens op gebaseerd zijn. What the fuck?” Een korte stilte. “ Hier zijn wat tips […]. Jelte, dat is de downside van een denker zijn. Jij en ik zijn daarin hetzelfde. Je bent een denker.”","text":"Het is inmiddels een uur of half een in de nacht, verwikkeld in een diepgaand gesprek. Het is de enige persoon die mij ongevraagd advies mag geven. Sterker nog, ik verwacht het. Het is een gewoonte, een gedachtewisseling die op een dieper niveau gaat dan ik met menigeen heb. “Joh, ik denk gewoon veel teveel na over dit ‘probleem’. Mijn hoofd maakt overuren. Het verschil tussen gevoel en ratio is ver te zoeken, er is een onbalans. Ik trek conclusies die nergens op gebaseerd zijn. What the fuck?” Een korte stilte. “ Hier zijn wat tips […]. Jelte, dat is de downside van een denker zijn. Jij en ik zijn daarin hetzelfde. Je bent een denker.” Ken je dat stemmetje? Men noemt het ook wel eens het stemmetje in je hoofd. In films wordt het meestal uitgebeeld door twee verschijningen: De engel en de duivel. De engel staat meestal voor de ratio, die ‘verstandige’ beslissingen neemt. De duivel staat voor dat stemmetje dat je meestal vertelt: “Fuck it, doe het gewoon. Doe het.” Weet je waar dit stemmetje opduikt? Meestal bij de onverstandige beslissingen. De triggers zijn overal, zonder dat je het van tevoren door hebt. Neem bijvoorbeeld een supermarkt. Men loopt naar binnen, met een lege maag. Nu weet je als weldenkend mens dat je eigenlijk de gezonde dingen zou moeten halen. Voor je het weet sta je echter buiten met de koekjes, de chips en die fles wijn. Waarom? Het stemmetje vertelt je: “Ah joh, boeiend. Vandaag mag je zondigen. Kan wel joh”. Het is een praktisch voorbeeld dat ik schets, die voor menigeen opgaat. Het is ook iets wat naar mijn idee emotioneel leed teweeg brengt. Je gevoel van zelfdiscipline word ermee ondermijnd, vaker dan je zou willen. Er komt een gevoel naar boven dat zegt en of vraagt: “Alweer? Wat is dat toch? Waar zit m’n verstand?”. Je ratio veinst een schuldgevoel. We weten allemaal dat het stemmetje er zit, hij is er altijd. We willen het eigenlijk niet al teveel plek geven, want het zegt af en toe dingen die soms volledig haaks staan op je overtuigingen. Op je principes. We willen ‘verstandig’ zijn, er is aan de andere kant veel sprake van ‘onverstandig’ gedrag. ZenIk grijp terug op iets dat ik heb geleerd uit Zen. Misschien dat ik in de toekomst hier nog wat uitgebreider over vertel, voor nu zal je het moeten doen met de volgende (vrije interpretatie) uitspraak: That what is, is. Suffering comes from not accepting the things that are. Resisting usually creates the opposite of that what you desire. Het viel als een puzzelstuk op z’n plaats, in deze situatie. Ik poogde voor dat moment eigenlijk dat stemmetje weg te drukken, zodat m’n ratio zou overheersen (wat voor de niet-genoemde sitatie het beste zou zijn naar mijn idee, een bewuste keuze). Echter, met het wegdrukken (resistance), creëer je het tegenovergestelde. Ken je het voorbeeld van de roze olifant? Nee? Als ik tegen jou zeg “Ik wil dat je nu NIET denkt aan een roze olifant”, waar denk je dan aan? Juist. Het is zoals het brein werkt, en dat zal je moeten accepteren. Dat was het moment. Het moment waarop ik dacht: “Natuurlijk, dat stemmetje is er altijd. Hoe harder ik hem wegdruk, des te harder gaat hij schreeuwen. Laat hem even praten, laat de ratio verder de verstandige beslissingen nemen.” Ik ben een denker. Met acceptatie over hoe ons denken werkt, wordt het een stuk makkelijker om bepaalde dingen te accepteren zoals ze zijn. Of denk ik nu iets teveel?","categories":[],"tags":[{"name":"psychology","slug":"psychology","permalink":"http://blog.jeltelagendijk.nl/tags/psychology/"},{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"Advies, wanneer wel en wanneer houd je je mond...","slug":"advies-hou-je-mond","date":"2014-06-25T00:11:00.000Z","updated":"2014-06-25T00:11:00.000Z","comments":true,"path":"2014/06/advies-hou-je-mond/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/06/advies-hou-je-mond/","excerpt":"Een lang verhaal aan de telefoon. Bij mij was er de dagen ervoor een grote mate van vraagtekens omhoog gekomen omdat ik bepaalde dingen simpelweg niet kon plaatsen. Het verhaal begon met een aantal argumenten, waar ik over moest nadenken. De eindconclusie eindigde in een vraag naar mij toe, althans een vraag die ik mezelf stelde vanuit het oogpunt van de ander: “Jelte, probeer je me te veranderen?”","text":"Een lang verhaal aan de telefoon. Bij mij was er de dagen ervoor een grote mate van vraagtekens omhoog gekomen omdat ik bepaalde dingen simpelweg niet kon plaatsen. Het verhaal begon met een aantal argumenten, waar ik over moest nadenken. De eindconclusie eindigde in een vraag naar mij toe, althans een vraag die ik mezelf stelde vanuit het oogpunt van de ander: “Jelte, probeer je me te veranderen?” We veranderen allemaal door de tijd heen (zie hier), hier zijn we zelf verantwoordelijk voor. Je kunt simpelweg anderen niet veranderen. Het verschil, ‘locus of control‘, haakt in op de mate van controle die je hebt over alles in het leven. Een van de belangrijkste lessen die ik heb geleerd in het verleden, is dat je geen invloed hebt op hoe anderen denken of zijn. Eigenlijk heel simpel. 100% controle over jezelf, 0% controle over een ander. Hou er dus ook niet van om mensen te vertellen wat ze moeten doen. Ik heb het liefst dat ik vragen stel en een ander laat nadenken erover. Echter, er is ook een tijd dat je gewoon simpelweg je mond moet houden. Dat men niet zit te wachten op je ‘wijsheid’… Dat was dan ook de strekking van het hele verhaal. Steeds luisteren naar iemands verhaal als bepaalde dingen niet goed gingen, en vrijwel elke keer een poging hierbij een goed bedoeld advies te geven. Dat begon dan meestal met “Nou weet je, ik heb dit zo en zo gedaan”, of “Ja wat nou als je dit zo en zo doet?”. Tot frustratie van de ander, zo bleek uit het telefoongesprek. En dat was de eye-opener. Het ‘aha’-moment. Ik deed naar mijn idee niets ‘fout’ (aangezien het goed bedoeld was), het was op dat moment echter wel ‘fout’. De kritiek was gegrond, de directe feedback een leuke les. Over het algemeen genomen was mijn positieve en plat geformuleerde interpretatie van de eindconclusie dan ook: “Jelte, je moet weten wanneer je je kop moet houden”. Een paar tips over advies Advies geven, alleen wanneer men er om vraagt Dit is eigenlijk de belangrijkste van de tips en lessen. Het is, als iemand problemen heeft, heel erg verleidelijk om de amateur psycholoog te spelen. Dit mag dan goed bedoeld zijn, je weet van tevoren niet of iemand advies wil. Vraag of iemand zit te wachten op advies, mocht je dat willen geven. Wees eerlijk met je advies Mensen zijn heel snel geneigd om te zeggen “Ik begrijp wat je bedoelt”, terwijl dat wellicht helemaal niet zo is. Empathie is fijn, je moet echter wel eerlijk zijn. Woorden (vanuit de optiek van NLP) zijn krachtig, weet dus welke je wel en welke je niet kunt gebruiken. Oordeel niet Als men om je advies vraagt, probeer niet te oordelen. Als je zegt “Je had dit moeten doen…” of iets dergelijks, is dat vooral een oordeel i.p.v. open advies. Frame dit wellicht op een manier als: “Ik had wellicht [..] gedaan, want naar mijn idee [..]”. Het geeft meer aan wat jij zou hebben gedaan, je onderstreept niet wat iemand naar jouw idee ‘fout’ heeft gedaan. Luister en geef mensen de ruimte om gewoon hun hart te luchten Dit grijpt terug op het eerste punt. Wees terughoudend, als je merkt dat iemand gewoon zijn/haar hart wil luchten. Vaak lucht het voor de persoon vooral op om even een woordje te doen. Dan zit diegene niet te wachten op ‘advies’, maar wil gewoon dat je luistert. Uit bovenstaande punten zijn het eerste en laatste vooral op mijzelf van toepassing geweest. In het stukje zelfreflectie, achteraf, kwam ik erachter dat ik dit in het verleden vaker heb gedaan. Hiermee duw je sommige mensen weg. Adviseren kun je leren, zwijgen en luisteren ook. Of, zoals een van de onderstaande bronnen suggereert: “Separate the person from trying to help them solve their problems. Be there to support the person but don’t try to help them solve their problems unless asked.” Heb je zelf nog meer tips? Laat het weten! Bronnen:http://crucialhabits.com/give-advice-to-people.htmlhttp://tinybuddha.com/blog/10-tips-advise-wisely-how-to-give-advice-that-actually-helps/","categories":[],"tags":[{"name":"psychology","slug":"psychology","permalink":"http://blog.jeltelagendijk.nl/tags/psychology/"}],"keywords":[]},{"title":"Veranderingen","slug":"veranderingen","date":"2014-06-24T12:35:54.000Z","updated":"2014-06-24T12:35:54.000Z","comments":true,"path":"2014/06/veranderingen/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/06/veranderingen/","excerpt":"Ik nodig je uit om 7 minuten te kijken naar onderstaande video. Het is een TED talk van Dan Gilbert, genaamd “The psychology of your future self”.","text":"Ik nodig je uit om 7 minuten te kijken naar onderstaande video. Het is een TED talk van Dan Gilbert, genaamd “The psychology of your future self”. Hij is humoristisch, hij heeft echter een belangrijk punt. En dit punt zie ik terug in mijn eigen overtuigingen, alsmede hoe ik denk dat anderen denken. In hoeverre denk jij over tien jaar nog hetzelfde te zijn dan dat je nu bent? En nog belangrijker, denk jij dat anderen nog hetzelfde zijn over zoveel jaar? We vergeten vaak dat we niet “af” zijn. Er is geen sprake van een moment dat je “af” bent. Hoe je nu bent, is hoe je nu bent. En dat zegt niets over hoe je over een half jaar, een jaar, 5 jaar of 10 jaar bent. We zijn dynamisch, net als de rest van deze planeet en sterker nog, het universum. We zijn aan veranderingen onderhevig, en hebben voor een groot deel ook zelf in de hand hoe we willen veranderen. Ik nodig je uit om de video te kijken. Het is een eye-opener. De mooiste uitspraak gaat bij mij in m’n boek aan quotes: Human beings are works in progress that mistakenly think they’re finished. It says it all! Source : TED","categories":[],"tags":[{"name":"psychology","slug":"psychology","permalink":"http://blog.jeltelagendijk.nl/tags/psychology/"},{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"Een opgeruimd leven...","slug":"een-opgeruimd-leven","date":"2014-06-23T14:15:54.000Z","updated":"2014-06-23T14:15:54.000Z","comments":true,"path":"2014/06/een-opgeruimd-leven/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/06/een-opgeruimd-leven/","excerpt":"Dit keer even niet over m’n rules. Neen, het ligt even stil. Niet qua mindset, vooral qua prioriteit. Ik maak me geen zorgen, de voortzetting van mn 30 rules komt snel. Er waren echter andere dingen die eerst getackled moesten worden. En dat is een proces dat zich al aan het voortzetten is de afgelopen paar weken. Eentje die me aan het hart gaat.","text":"Dit keer even niet over m’n rules. Neen, het ligt even stil. Niet qua mindset, vooral qua prioriteit. Ik maak me geen zorgen, de voortzetting van mn 30 rules komt snel. Er waren echter andere dingen die eerst getackled moesten worden. En dat is een proces dat zich al aan het voortzetten is de afgelopen paar weken. Eentje die me aan het hart gaat. Laat ik allereerst iets zeggen over hoe ik ben. Als je mijn blog gelezen hebt tot nu toe, zie je een bepaald patroon. Nee, juist niet. Er was geen peil op te trekken. De ene keer gaat het over cyber security, dan gaat het weer over programmeren, dan weer over lifehacking. Het zijn mijn passies, alleen was er weinig consistentie in te vinden. In de essentie van mijn ‘zijn’, heb ik een aantal krachtige punten, en een aantal zwakke punten. We zijn tenslotte allemaal mens, nietwaar? (Zo’n heerlijke cliché uitspraak dat nog net geen ‘sorry‘ is) Een van mijn eigenschappen is chaos. Dat heb ik al lang geleden onderkend, ik heb er alleen nooit iets mee gedaan. Althans, niet bewust. Tot een paar weken geleden… Chaos is overal eigenlijk. Zonder een aantal strikte regels en overtuigingen, alsmede richtlijnen, zou het leven eigenlijk één grote chaos zijn… Het internet en de media draagt hier aan mee. Als mensen worden wij dagelijks gebombardeerd met informatie. Het is makkelijk om jezelf hierin te verliezen. We worden blootgesteld aan reclame op TV, we klikken door op de blogposts op Facebook, we worden overstelpd met productplacement en kortingen in de supermarkt, etcetera. Het gevolg: een information overload! Als bijna een zombie door het leven gaan door het bombardement aan prikkels. Nu schets ik dit wellicht een tikje zwart-wit, in essentie lijkt me dit een goede analogie… Tot een aantal weken geleden dacht ik dat ik het voor elkaar had. Een prima baan, nog zoekende naar de ware, een paar goede vrienden, een lifestyle. En toch miste er iets… Of liever gezegd, er was iets teveel. De chaos. De chaos om me heen die een information overload teweeg bracht. Mezelf kennende, en de technieken, zocht ik naar een antwoord. Meditatie, het rustpunt zoeken. “Laat het antwoord komen, laat je brein het werk doen…”. Het antwoord op deze chaos. En het antwoord kwam snel. Mijn vraag aan jou is dan ook: Hoe opgeruimd is jouw leven? Het eerste wat me opviel was de chaos waarin ik zat. Als we het over materialisme hebben, dan is dat mijn huis. Het leek aan de oppervlakte opgeruimd, niets was minder waar. Spullen die ik niet meer gebruikte, lagen opgeslagen. De enige reden dat ik ze bewaarde was “hier heb ik wellicht, ooit, in deze situatie, nog wat aan”. De papierwinkel die stof lag te happen was van hetzelfde kaliber. Papieren of brieven die ik nog moest lezen, of gewoonweg diende te bewaren. Ik trek het echter nog verder. Enig idee hoeveel TV je kijkt per dag? Wat is er meer zinloos dan naar een scherm te kijken dat licht uitzendt, onder het mom van ‘entertainment’, zonder enige input van jezelf? Niks toch? Ja. natuurlijk, het is ‘leuk’, het is alleen weinig productief? Hier moet ik overigens een kanttekening bij maken, met betrekking op de actualiteit. Ook ik kijk wel eens TV, althans één keer de laatste tijd. Het WK. Natuurlijk kijk ik het Nederlands elftal en geniet ik daarvan. Het enige verschil met ‘normaal tv kijken’? Je doet dit met anderen! Samen iets kijken, de vreugd of de lol delen. Dat is het enige leuke aan TV kijken, mét anderen. Hoeveel mails liggen er nog te wachten? Hoeveel taken zijn er nog open? Welke dingen stel je uit? Dat zijn de vragen die ik mezelf stelde. Het antwoord was in 1 simpel antwoord te formuleren: “teveel!”. En dus begint het opruimen. Alles, maar dan ook alles opruimen. Het opruimen begon een aantal weken geleden pas echt. De kabel is uit de TV getrokken, de papieren zijn ingescand en weggegooid en elke kast heeft al een goede opruimbeurt gehad. Alle mails zijn uit m’n mailbox verdwenen, alle zinloze pagina’s op Facebook disliked en zelfs m’n phone begint leeg te raken. Recepten zijn gearchiveerd, ik heb een lijst met m’n boeken die ik wil lezen, heb een overzicht van de audiobooks die ik wil luisteren. De financiën zijn gebudgetteerd, de afwas is gedaan, de vuilniszakken de deur uit… Ik weet exact wat ik op mijn werk moet doen, welke zaken prioriteit hebben, welke mails moeten worden beantwoord… Hoe leger je leven is, als het gaat om afleidingen en onzinnige dingen, des te meer rust creëer je. Hoe meer rust je creëert, hoe beter de overzichten zijn. En hoe beter het overzicht in je leven, des te opgeruimder ben je… De cliché uitspraak: “Een opgeruimd huis, is een opgeruimd hoofd”. Laten we het breder trekken… “Een opgeruimd leven, is een opgeruimd hoofd”. Tijd, energie en ruimte voor de volgende uitdaging! De gadget- en technologiefanaat die ik ben, geniet ik van de geneugten die technologie me bied hierin. Twee dingen die in het einde van deze blogpost met je deel, als onderdeel van het GTD (Getting Things Done) proces met je deel: 1.) Google Tasks. Ik maak zelf gebruik van “Business Tasks“, een app voor Android. Het fijne aan deze app, naast dat het gratis is, is de mate van flexibiliteit. Subtaken aanmaken, reminders, het zit er allemaal in. En dus neem ik deze app als de heilige graal en maak hier dagelijks gebruik van. Orde in de chaos scheppen begint met het structureren van lijsten. De developer die ik ben, maak ik daarbij ook gebruik van een aantal SCRUM termen: Mijn lijst met zaken die geen prioriteit hebben, gaan op, wat men noemt, de ‘backlog’. Alles wat prioriteit heeft, staat op de dagelijkse TODO. En het is een uitdaging om die dagelijkse lijst leeg te krijgen. Dat creeert rust! 2.) Lift. Ik grijp hier terug op een blogpost die ik in januari 2013 schreef. Het gaat daarin om de 30-day-challenge. De app Lift (Het is een web-app, hij is ook voor Android te vinden), is eentje die inhaakt op het idee van een dergelijke challenge, namelijk het veranderen, danwel aanleren van een gewoonte. Wat het met name doet is je dagelijkse reminders geven. En ik ben dus bezig met een aantal challenges, de belangrijkste is “Unclutter” (opruimen).","categories":[],"tags":[{"name":"psychology","slug":"psychology","permalink":"http://blog.jeltelagendijk.nl/tags/psychology/"},{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"Sorry :: The rules","slug":"rules-sorry","date":"2014-05-25T21:52:17.000Z","updated":"2014-05-25T21:52:17.000Z","comments":true,"path":"2014/05/rules-sorry/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/05/rules-sorry/","excerpt":"Langzaam aan begon het tot me door te dringen. Het was een dinsdagavond, pakweg 2 jaar geleden. De mindmap, een overzicht van problematiek die ik op dat moment ondervond, was in de verste verte nog niet af. Steekwoorden hier en daar, verbindingen naar belangrijke onderwerpen en vooral “wat wil ik nog meer?”. Ieder punt was te benoemen, ik had sowieso een aantal zaken die ik graag wilde in mijn leven. En toch, toch was het er nog niet van gekomen. De vraag die ik mezelf stelde, terwijl mijn blik verdwaald raakte in de wirwar van connecties bij elk onderwerp, was een standaardvraag: “Waarom heb je dit nog niet? Hoezo niet?”. De denkbeeldige kritische jury stond voor me en bekogelde me met vragen. Het antwoord op alle vragen begon met…. “Ja sorry, maar…”","text":"Langzaam aan begon het tot me door te dringen. Het was een dinsdagavond, pakweg 2 jaar geleden. De mindmap, een overzicht van problematiek die ik op dat moment ondervond, was in de verste verte nog niet af. Steekwoorden hier en daar, verbindingen naar belangrijke onderwerpen en vooral “wat wil ik nog meer?”. Ieder punt was te benoemen, ik had sowieso een aantal zaken die ik graag wilde in mijn leven. En toch, toch was het er nog niet van gekomen. De vraag die ik mezelf stelde, terwijl mijn blik verdwaald raakte in de wirwar van connecties bij elk onderwerp, was een standaardvraag: “Waarom heb je dit nog niet? Hoezo niet?”. De denkbeeldige kritische jury stond voor me en bekogelde me met vragen. Het antwoord op alle vragen begon met…. “Ja sorry, maar…” Hoe vaak zeggen we “sorry” in ons leven? Neem een moment en sta er eens bij stil. Stel jezelf de vraag: “Wanneer is de laatste keer dat ik sorry heb gezegd? En dat moment, was dat een échte sorry?” Ik begon mezelf dit af te vragen… Wanneer zeg je eigenlijk het woord sorry? En wat is de betekenis ervan? Een moment van zelfreflectie die ik tot dan toe niet had ervaren. Het patroon was ineens herkenbaar, het was een stopwoordje geworden. De zin begon met een sorry, of eindigde ermee. Niet alleen ten opzichte van anderen, tevens naar mezelf. Vooral dat laatste speelde ineens een cruciale rol. Door excuses aan te bieden aan jezelf, praat je je eigen falen of inactiviteit daarmee goed. Verzachtende woorden naar jezelf toe. Het gaat echter nog verder. De vorm van onzekerheid die ik met me mee droeg, vertaalde zich ook naar een groeiend aantal keer sorry zeggen naar anderen toe. En die vertaling was niet eens letterlijk. Meer het gevoel dat je in je hoofd sorry moet zeggen dat je bepaalde dingen op een dergelijke manier doet. De juiste zin bij dit gevoel zou zijn: “Sorry, zo ben ik nu eenmaal. Sorry voor mijn gedrag.” Ik ben ermee gestopt. In de lessen die ik leerde uit o.a. NLP, ben ik kritisch gaan kijken naar het taalgebruik. Naast het woordje “maar” (wat een eventueel vervolg krijgt qua uitleg, daar het woord “maar” een krachtige doch negatieve betekenis heeft) vermijd ik het woord “sorry” enorm. En dat heeft een impact op je eigenwaarde, alsmede hoe anderen naar je kijken. Laten we het uiteindelijk nog, in het kort, iets beter bekijken: Waarom zou je “sorry” moeten zeggen voor het feit dat je zo bent? Waar het op neerkomt is dat als je dit vaak genoeg zegt, het een self fulfilling prophecy wordt. Je gaat er zelf in geloven, terwijl je veel meer waard bent dan dat… We hebben niet voor niets het woord “sorry” opgenomen in ons woordenboek. Stammend uit het oud Engels “sarig”, dat (in het Engels) vertaald wordt als “distressed, grieved, full of sorrow”. De enige keren dat je naar mijn idee “sorry” dient te zeggen naar een ander toe, is als het gemeend is. Dat je iets doet wat een ander geschaad, beledigd of gekwetst heeft. Uitsluitend dan is het zaak dat je sorry zegt. Een oprechte excuses, die voortkomt uit een schuldgevoel. Dat je weet dat je iets fout hebt gedaan. Dat is dus de gezonde en oprechte uitzondering op mijn regel “zo min mogelijk sorry zeggen”. The rule “Sorry”:De uiteindelijke conclusie van de vragen, alsmede de betekenis van het woord, leidde tot de simpele regel: “Zeg zo min mogelijk ‘sorry.’ Hoe minder vaak je dat woord gebruikt, des te krachtiger is de boodschap als je het wel zo bedoelt” Simpel. Hoe minder vaak je sorry zegt en het woord dus zeer bewust en beperkt gebruikt, des te groter is de impact van het woord als je het wél zegt. Niet alleen naar anderen toe, zeker ook naar jezelf toe. Voor mij is dit een heldere regel, daarom is hij ook opgenomen in de reeks met regels die ik publiceer (n.a.v. deze blogpost).","categories":[],"tags":[{"name":"psychology","slug":"psychology","permalink":"http://blog.jeltelagendijk.nl/tags/psychology/"},{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"The rules... Het begin","slug":"rules-het-begin","date":"2014-05-04T22:45:52.000Z","updated":"2014-05-04T22:45:52.000Z","comments":true,"path":"2014/05/rules-het-begin/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/05/rules-het-begin/","excerpt":"Het is een donderdagavond, een uurtje of negen. Op Whatsapp heb ik een discussie met Annemarie, het gaat onder andere over bloggen. We hebben het over doelen stellen, over bloggen en wat het inhoudt. Gaandeweg het gesprek, waarin zij advocaat van de duivel speelt en me begint te bombarderen met vragen, die veelal beginnen met “waarom”, begint er bij mij een beeld te ontstaan. Het beeld van een reeks blogposts die al een jaar lang op de boekenplank stof liggen te happen in de vorm van ideeën en half geschreven verhalen. “Verdomme, je hebt gelijk. Ik moet hier iets mee gaan doen!”, app ik met een glimlach. Dat doorvragen… Een beproefde methode om mijn chaotische hoofd met Rotterdamse mentaliteit (“Zeg gewoon wat je denkt”) flink te triggeren. And so it begins!","text":"Het is een donderdagavond, een uurtje of negen. Op Whatsapp heb ik een discussie met Annemarie, het gaat onder andere over bloggen. We hebben het over doelen stellen, over bloggen en wat het inhoudt. Gaandeweg het gesprek, waarin zij advocaat van de duivel speelt en me begint te bombarderen met vragen, die veelal beginnen met “waarom”, begint er bij mij een beeld te ontstaan. Het beeld van een reeks blogposts die al een jaar lang op de boekenplank stof liggen te happen in de vorm van ideeën en half geschreven verhalen. “Verdomme, je hebt gelijk. Ik moet hier iets mee gaan doen!”, app ik met een glimlach. Dat doorvragen… Een beproefde methode om mijn chaotische hoofd met Rotterdamse mentaliteit (“Zeg gewoon wat je denkt”) flink te triggeren. And so it begins! Het begin van een lang procesEen kleine achtergrondschets is op zijn plaats, voor de komende blogreeks… Het is een jaar of tweeënhalf geleden dat ik hieraan begon, “The rules”. Ik was kort voor het begin van het proces een psychologisch wrak. Werkloos geweest voor twee maanden. M’n liefdesleven was met een duikvlucht neergestort. Met name de manier waarop leidde tot een zwaar verminderd zelfbeeld. Er werden naar mijn gevoel een aantal fundamenten van mijn leven weggeslagen op dat moment. De rollercoaster was al ingezet een half jaar ervoor. Een beperkte relatie met mijn ouders (door ruzie waar ik zelf voor het grootste deel debet aan was), een half afgemaakte studie, een studieschuld, een ongezonde emotionele situatie en een verkeerde lifestyle. Al met al, op z’n zachtst gezegd, een behoorlijke kutsituatie. Langzaam ging het beter. De relatie met m’n ouders was hersteld, ik had een nieuwe baan en dus stabiliteit. Al met al leek het dus aan de buitenkant goed te gaan. Mensen zagen me als happy, ik liep rond met een smile en aan de oppervlakte leek het dus oké. Desalniettemin knaagde er iets. Het gevoel van controle kwam langzaam terug, alleen manifesteerde zich nog niet als dusdanig dat ik een doel voor ogen had. Levensdoelen, so to speak. Een set met regels en motto’s die mij definieerde… VriendenVrienden kies je. En ze kiezen ze jou. Ik geloof niet in ‘het lot’, ik geloof echter wel dat er momenten zijn dat je de juiste personen, op het juiste moment, leert kennen. Met dezelfde interesse voor psychologie, een positieve attitude, en met het advies dat ongedwongen wordt gegeven. Juist die vrienden boorden op dat sleutelmoment een belangrijk speerpunt aan: Een doel voor ogen hebben, levenslust en energie. De stijgende lijn. The rulesEr moest iets gebeuren. De boeken in duiken, meningen van anderen vragen en een open dialoog aan gaan met vrienden. Het besluit “en zo kan het niet langer”, was genomen. Het leidde uiteindelijk tot, wat ik zelf noem: “The rules”. Gegeven dat je uit een diep dal komt, is het aan jezelf om je weer op te bouwen. Geen enkel persoon kan dit voor je doen, je bent een volwassene die uiteindelijk zelf de verantwoordelijkheid draagt voor je eigen geluk. En daar heb je houvast bij nodig… Principes… Een set met heldere regels. In een proces van wederopbouw heb ik in een jaar tijd mijn leven geherdefinieerd. Dit roept vragen op. Een vragende blik, gevolgd door schamper gelach: “Hoezo herdefiniëren? Je bent toch gewoon wie je bent?”. Natuurlijk, ik ben nog steeds dezelfde persoon. De regels, principes en het speelveld zijn echter veranderd. Waar er eerst een gemis in controle was en voelde als een langdurige emotionele groeistagnatie, begonnen de “regels” aangescherpt te worden en een belangrijke houvast te bieden. Het gevolg: Controle over je eigen geluk, een stijgende lijn in blijdschap en een nog belangrijker: een groei in emotionele volwassenheid. Het doelHet is inmiddels al een tijd geleden dat ik begonnen ben met “The rules”, en ben op een punt beland dat ik ze wil delen. Mijn doel is helder: Ik wil mijn kennis en mening delen. Zie mij niet als autoriteit op het gebied van personal development, ik vertel mensen niet “Zo moet het”. Het is een poging tot een bijdrage leveren aan zelfinzicht. En zelfinzicht is naar mijn idee de belangrijkste factor voor persoonlijke groei. Als ik ook maar 1 persoon kan helpen met mijn mening en verhaal… dan is mijn doel bereikt. Ik hoor ook graag de mening van anderen, dit is een interactie. Reageer waar nodig, en bouw mee aan jouw, en mijn, zelfinzicht! Tot dusver mijn intro. Nu komt het erop aan… Het schetsboek ligt klaar, de aantekeningen worden uit de kast gehaald en ik stof mijn concepten af. Let’s do this! Annemarie is blogger voor o.a. Suksawat in Leeuwarden. Ze heeft haar eigen bedrijf “Letterlijke Verleiding“, en de methode die ze toepaste, door blijven vragen over mijn doelen en het “waarom?”, hebben uiteindelijk mij ertoe gezet om mijn initiatief nieuw leven in te blazen. Ik wil haar bedanken voor die trigger!","categories":[],"tags":[{"name":"psychology","slug":"psychology","permalink":"http://blog.jeltelagendijk.nl/tags/psychology/"},{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":" Git. Learn to branch, command-line....","slug":"learn-git","date":"2014-03-20T13:27:50.000Z","updated":"2014-03-20T13:27:50.000Z","comments":true,"path":"2014/03/learn-git/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/03/learn-git/","excerpt":"Push, pull, branch, pull requests, cherry-picking… No, these words do not come from some sort of bad C-rated adult movie… These are terms I work with on a daily basis, using Git “Git on Wikipedia”). In the past I have worked with Subversion “Subversion on Wikipedia”), which was a total nightmare (in my humble opinion ofcourse, I do not want to offend people who like SVN). Version control comes in many flavors. Lately I have been working in several teams on various big projects, and so the need for version control of your code is necessary.","text":"Push, pull, branch, pull requests, cherry-picking… No, these words do not come from some sort of bad C-rated adult movie… These are terms I work with on a daily basis, using Git “Git on Wikipedia”). In the past I have worked with Subversion “Subversion on Wikipedia”), which was a total nightmare (in my humble opinion ofcourse, I do not want to offend people who like SVN). Version control comes in many flavors. Lately I have been working in several teams on various big projects, and so the need for version control of your code is necessary. Git GUI:Personally, I like SourceTree, made by Atlassian (Which is actually not that strange since we use Confluence and Jira, other products of Atlassian, on a daily basis as well). It’s a convenient GUI to do your Git-related work, in a very visual and intuitive way. Yet, sometimes command-line beats the crap out of GUI-programs, and ofcourse you need to know the underlying techniques. I love command-line for a long time, always been the Linux-guy (although, unfortunately I have to work with Windows in my professional job, and Cygwin isn’t that great). Now I must say that the oldskool man-pages for Git are not that informative (allthough cheatsheets help!), and so I was looking for something different. Tutorial:A colleague of mine came up with a very informative and visual tool to learn how Git works. It is on Github, even the source code of it. Have a look at an awesome tool created by Peter Cottle. The tutorial can be found here: http://pcottle.github.io/learnGitBranching/ I love it! Still returning to these tutorials to get a good grip on how to branch in Git using only the command-line. Do you have any more informative tutorials or tips on how to improve your experience with Git? Please leave a comment… I’d love to learn more about it.","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Keep up with the latest Javascript & technologies","slug":"keep-up-javascript","date":"2014-03-09T13:29:28.000Z","updated":"2014-03-09T13:29:28.000Z","comments":true,"path":"2014/03/keep-up-javascript/","link":"","permalink":"http://blog.jeltelagendijk.nl/2014/03/keep-up-javascript/","excerpt":"I love Javascript! As a Front-end Developer it is essential that you keep up with the latest technologies, keep experimenting with new stuff. Keep your creativity flowing. So, how do you keep up?","text":"I love Javascript! As a Front-end Developer it is essential that you keep up with the latest technologies, keep experimenting with new stuff. Keep your creativity flowing. So, how do you keep up? RSSSubscribe to websites that give you in-depth tutorials! Myself, I have over 250 websites that I follow on Feedly, categorized (also on other subjects like personal development). RSS is a lifesaver, no more browsing every website, but keep everything in one place…. I used to do this in Google Reader, unfortunately Google decided to remove this service. I can’t share a list with subscribed websites from Feedly, but have a look at my @j3ltedev account on Twitter. This automatically shares new articles that are on the subject of HTML5/CSS/JS in Feedly, through IFTTT. TwitterFollow the websites on Twitter. I have a list on Twitter, allthough this one isn’t up to date. I like Feedly more… Need to do an update on all the websites. My list on NodeJS is more comprehensive. Javascript NewslettersSubscribe to newsletters. I have been an avid reader of Javascript Weekly since a year. It keeps up with the latest technologies. Take a look at the latest issue here. For now, that’s all. I had an interesting talk last week with two guys who are far more into Javascript than I am, so it seemed. They adviced me to have a look at the core Javascript and new technologies. So, for now, I will be focussing on Vanilla Javascript and the upcoming technologies that are described in the ECMAScript 6 proposed guidelines, the upcoming standard that will be ratified in December 2014 (expected). Have a look at this awesome overview. Let’s dive into it! Please, if you have more tips on websites/newsletters and other in-depth websites on the subjects, feel free to comment!","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Grunt, Connect, JSON API and Cross Domain trouble","slug":"grunt-connect-json-api-cross-domain","date":"2013-09-06T14:44:34.000Z","updated":"2013-09-06T14:44:34.000Z","comments":true,"path":"2013/09/grunt-connect-json-api-cross-domain/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/09/grunt-connect-json-api-cross-domain/","excerpt":"The last couple of months I have been pretty busy, started a new job. Finally, I am now a full-time front-end developer at a big company. In those last months I learned a couple of new things as well. One of them is Grunt, an awesome task runner. I used it to build templates, based on Twitter Bootstrap. The very neat part of Grunt is doing everything automatically. Never worrying about minifying your CSS, converting that from LESS, uglifying your Javascript files, and so on. What I didn’t knew before was that Grunt as a plugin, called server. It does what it says it does.","text":"The last couple of months I have been pretty busy, started a new job. Finally, I am now a full-time front-end developer at a big company. In those last months I learned a couple of new things as well. One of them is Grunt, an awesome task runner. I used it to build templates, based on Twitter Bootstrap. The very neat part of Grunt is doing everything automatically. Never worrying about minifying your CSS, converting that from LESS, uglifying your Javascript files, and so on. What I didn’t knew before was that Grunt as a plugin, called server. It does what it says it does. I decided to take on a old project I did about a year ago. I had to create several HTML templates, and back then I was struggling with it. I created the files using PHP. Looking back at that, and with knowledge of now, I have spend countless hours doing unproductive things that I could have prevented using Grunt. So I decided to dust off the old files, decomposing them and recreate the whole project using Grunt, Assemble and LESS. Just for the sake of experimentation. It took me roughly one day to setup the new project and converting all the old templates to newer handlebar-templates, while extensively using partials. Fun! In this particular project I had a JSON API that was being called on the same domain. On production level there were no problems with the Cross-Domain Policy, because it ran on the same domain. The only problem I had: how do I test this on my own computer? Back then I created a small PHP file that would basically tunnel my requests to the domain, using curl. Ofcourse this is not the most ideal solution, but I had no choise. I wasn’t in control of the API and so I could not set any policies. Now, with Grunt, I was able to run a server (using Connect) from my command-line, while using ‘watch’ as well. The only problem I had? How to create the tunnel for my JSON api? It costed me hours of struggling to find the right plugin, only to find out that there was no plugin that would fit my needs. So, it’s time for some oldskool stuff. How to do it? Have a look at this: So basically, I used the middleware in connect to filter the requests. Any request that are done on http://localhost/api/ will be forwarded to http://domain.com/api/. When the request is done and responds with data and an HTTP 200 header, it forwards the body to my local request. So, this is my quick and dirty solution. If you have any other ideas how it can be done (I have searched for hours on Google, finding a practical solution), please let me know! Edit: The solution Drew gave me, seems to do the job as well. Have a look at: https://github.com/drewzboto/grunt-connect-proxy","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Node Mandelbrot","slug":"node-mandelbrot","date":"2013-07-15T10:14:43.000Z","updated":"2013-07-15T10:14:43.000Z","comments":true,"path":"2013/07/node-mandelbrot/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/07/node-mandelbrot/","excerpt":"Het is alweer wat jaren geleden dat ik mijn VWO diploma behaalde. Voor het profiel NT had ik als onderwerp voor het profielwerkstuk: Fractals. Geïnteresseerd in wiskunde, wilde ik dit graag verder uitdiepen. Een van de meest bekende fractals is de Mandelbrot-verzameling. Lees gerust verder op Wikipedia wat het inhoudt.","text":"Het is alweer wat jaren geleden dat ik mijn VWO diploma behaalde. Voor het profiel NT had ik als onderwerp voor het profielwerkstuk: Fractals. Geïnteresseerd in wiskunde, wilde ik dit graag verder uitdiepen. Een van de meest bekende fractals is de Mandelbrot-verzameling. Lees gerust verder op Wikipedia wat het inhoudt. In mijn eerste jaar Informatica diende wij deze fractals te genereren in Java. Nu, zoveel jaar verder, leek het me leuk deze te genereren in HTML5. Dit was echter voor mij niet goed genoeg, dus besloot ik om hier NodeJS voor te gebruiken en het server-side te doen. En, in het kader van het open source krijgen van creaties, heb ik hem nu gedeeld op Github. Zoals je wellicht kunt zien, is deze code verre van optimaal. Hier ga ik in de toekomst nog aan werken (Async uitrekenen van blokken) Hier de code voor het genereren ervan in Express (routes/index.js) Zie de volledige code in mijn repository: https://github.com/j3lte/node-mandelbrot","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Twitter, look and feel. Metro","slug":"twitter-look-and-feel-metro","date":"2013-05-21T17:42:56.000Z","updated":"2013-05-21T17:42:56.000Z","comments":true,"path":"2013/05/twitter-look-and-feel-metro/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/05/twitter-look-and-feel-metro/","excerpt":"","text":"I’ve been tweeting a lot lately, and wanted to try something new. I like the Metro UI “Modern UI”) that comes with Windows 8, and I have been bothered by the ugly rounded look that is called “Twitter Bootstrap“. It seems to slow down my browser experience when using Twitter. Luckily it’s possible to change the look &amp; feel of any website in Firefox and Chrome. Userstyles! Here’s my Userstyle for Twitter, which will give you a more slick look and feel. Comments are welcome!","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Scraping the web: 4chan & NodeJS","slug":"scraping-the-web-4chan-nodejs","date":"2013-04-06T16:33:12.000Z","updated":"2013-04-06T16:33:12.000Z","comments":true,"path":"2013/04/scraping-the-web-4chan-nodejs/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/04/scraping-the-web-4chan-nodejs/","excerpt":"It’s been a while that I’ve posted something new. Busy doing work and several projects on the side. Got some major things going on, that’s why I have not been able to keep up with my blog. So today is a new day!","text":"It’s been a while that I’ve posted something new. Busy doing work and several projects on the side. Got some major things going on, that’s why I have not been able to keep up with my blog. So today is a new day! Update September 2014 : I had this Gist-file somewhere around. During the whole Fappening, I came to the conclusion that I should create a tool. It is still work-in-progress, but have a look at my latest NodeJS creation : chanarchive A couple of weeks ago I had a meeting with a couple of developers, discussing new technologies. We talked about sharing knowledge, and it came to my attention that I have not shared much code in the past. Part of being able to grow knowledge is the open-source community, and so I want to share this with you. I opened up my Github account and will post various Gists on there. Feel free to contribute or comment! I like scraping the web. I like NodeJS. Put those two things together and you come up with several new things to write and explore. I’ve been a fan of 4chan for a couple of years now, which is fun on some days. They have implemented a JSON API, that can be used for things like mobile apps. So, I created a little scraper that will download every picture from a specific thread. It can be found on Github.","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"The Pirate Bay: Away From Keyboard","slug":"the-pirate-bay-away-from-keyboard","date":"2013-02-14T13:20:31.000Z","updated":"2013-02-14T13:20:31.000Z","comments":true,"path":"2013/02/the-pirate-bay-away-from-keyboard/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/02/the-pirate-bay-away-from-keyboard/","excerpt":"","text":"“The Pirate Bay: Away From Keyboard”. Interesting documentary about the guys behind The Pirate Bay. This is about their trial, and gives you some insight in their actions, why they do things the way they do. I do not condone copyright violation, it is just an interesting video about the guys behind it. It reminds me of a video I have seen before, where a guy talks about the internet: “The more mature the internet becomes, the less value the information has”. This basically means that all information on the internet will eventually be free.. Just watch the video…","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"One piece of grey","slug":"one-piece-of-grey","date":"2013-02-06T01:05:17.000Z","updated":"2013-02-06T01:05:17.000Z","comments":true,"path":"2013/02/one-piece-of-grey/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/02/one-piece-of-grey/","excerpt":"","text":"My thoughts, in a poem. Not my first, never my last. Just my one piece of grey. This time I refuse to acceptWhat reality seems to throw at meSurvival of conflicting thoughtsThe master of zen that I can be Irrational logic in eventsThe thinker thinks throughIs it it just a bad turn of mind?Waiting is the only thing I can do The challenge is not to controlThat what cannot be controlledAnswering that one questionWithout a single word being told The red roses will slightly fadePerfect scent gets carried awayAs I enter a lucid dreamstate knowingTomorrow is a whole new day My sight gazes upon the futureNever dwelling in the pastA gentle smile while I close my blue eyesMy impression will forever last And yet…","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"},{"name":"poem","slug":"poem","permalink":"http://blog.jeltelagendijk.nl/tags/poem/"}],"keywords":[]},{"title":"Become a better writer","slug":"become-a-better-writer","date":"2013-01-30T15:44:51.000Z","updated":"2013-01-30T15:44:51.000Z","comments":true,"path":"2013/01/become-a-better-writer/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/01/become-a-better-writer/","excerpt":"","text":"This answer on Quora pretty much sums it up: Read Quote of Anon User’s answer to How does one become a better writer? on Quora","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"Challenge... accepted","slug":"challenge-accepted","date":"2013-01-06T13:24:45.000Z","updated":"2013-01-06T13:24:45.000Z","comments":true,"path":"2013/01/challenge-accepted/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/01/challenge-accepted/","excerpt":"Het stuk gelezen over “Goede voornemens“? Right, dat zou iets duidelijk moeten maken over het stellen van doelen en dient enigszins als houvast qua regels voor het maken van die doelen. Echter, wat als we een gewoonte willen veranderen? Ik vertelde al hoe het niet mogelijk is om ergens niet aan te denken, toch? Hoe verander ik dan een gewoonte? Het is een stuk zelfdiscipline dat je daarvoor nodig hebt, alleen is het iets waar velen in falen. Hier ben ik zelf ook schuldig aan. Een bepaald doel voor ogen hebben (af- of aanleren van een gewoonte), alleen kan ik er geen tijdslimiet of deadline aan vastknopen.","text":"Het stuk gelezen over “Goede voornemens“? Right, dat zou iets duidelijk moeten maken over het stellen van doelen en dient enigszins als houvast qua regels voor het maken van die doelen. Echter, wat als we een gewoonte willen veranderen? Ik vertelde al hoe het niet mogelijk is om ergens niet aan te denken, toch? Hoe verander ik dan een gewoonte? Het is een stuk zelfdiscipline dat je daarvoor nodig hebt, alleen is het iets waar velen in falen. Hier ben ik zelf ook schuldig aan. Een bepaald doel voor ogen hebben (af- of aanleren van een gewoonte), alleen kan ik er geen tijdslimiet of deadline aan vastknopen. Waar het op neerkomt is dat het een doel is zonder einde. Dus een bepaalde gewoonte die je wilt afleren, maar wat dus eindeloos voortduurt. Voorbeeld: “Ik stop met het gebruik van suiker in m’n koffie”. Wanneer mag ik het dan wel weer doen? Nooit! Nu is dit een licht voorbeeld (er zijn zwaardere te bedenken, zoals stoppen met roken), het illustreert een probleem: Het is tijdloos. Het woord “nooit” of “voor altijd” blijven resoneren in gedachten. Je maakt een beslissing die je dan voor de rest van je leven zal moeten voortzetten. Vooral die laatste opmerking maakt dat veel mensen falen in het afleren van een dergelijke gewoonte. Sommigen hebben een ijzersterke wil en kunnen zich vasthouden aan een beslissing. Voor de meeste anderen, tenzij het een zaak van leven en dood is, zal zoiets niet lang standhouden. Hoe zou je het veranderen van een gewoonte kunnen benaderen?Al een tijdje ben ik aan het experimenteren met het concept “30-day challenges”. De nu volgende video, een TED-talk van Matt Cutts, illustreert bijzonder goed hoe een 30-day challenge in z’n werk gaat: Je start een bepaald experiment, betreffende een gewoonte die je zou willen aan- of afleren, of puur iets dat je graag eens uit zou proberen. Het doel is nu echter niet meer een gewoonte te veranderen (voor altijd), het gaat puur om het volbrengen van de challenge (die dus een einde heeft). Zie het als een experiment! Je doet iets voor dertig dagen lang, en je weet dat je na die dertig dagen weer terug kunt naar je oude ik. Het is een kwestie van volhouden en aftellen van de dagen. Maak er een sport van! Een gewoonte is daarmee sneller afgeleerd dan je zou denken, puur omdat je na die 30 dagen de keuze hebt om weer terug te gaan naar de oude situatie, of het vol te houden. Ongeacht je keuze die je dan maakt, kun je er geen spijt van krijgen, wetende dat je de challenge hebt volbracht. Voor mij staan er een aantal challenges opgeschreven, die ik stuk voor stuk ga uitvoeren en documenteren. Hier en daar dien ik de regels nog te finetunen voor minimale effort met maximaal resultaat. Ik wil resultaat zien. Momenteel ben ik bezig met: “30 dagen lang geen tv kijken in je eentje en/of thuis”. Ik mag dus alleen naar de tv kijken als ik bij of met iemand anders ben. Is simpel opgesteld en simpel uit te voeren. Je dient klein te beginnen, wil je groots slagen. Inmiddels, na drie weken geen tv, kan ik bijna met zekerheid zeggen dat ik het nul komma nul mis. De productiviteit, alsmede creativiteit in mijn hoofd, lijken met de dag toe te nemen. Geen bullshit tv meer ‘s avonds als ik thuis kom, het nieuws en films kijk ik af en toe online als ik zin heb. What’s your challenge?","categories":[],"tags":[{"name":"psychology","slug":"psychology","permalink":"http://blog.jeltelagendijk.nl/tags/psychology/"},{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"De kracht van Javascript","slug":"kracht-van-javascript","date":"2013-01-03T16:45:52.000Z","updated":"2013-01-03T16:45:52.000Z","comments":true,"path":"2013/01/kracht-van-javascript/","link":"","permalink":"http://blog.jeltelagendijk.nl/2013/01/kracht-van-javascript/","excerpt":"Ik ben inmiddels al meer dan een jaar full-time als developer aan de slag en dit bevalt me goed. Ik startte als een rookie eigenlijk, met basiskennis van .NET en PHP. Door de tijd heen ben ik me meer gaan focussen op front-end development, en hetgeen waar ik minder kaas van had gegeten, was Javascript. Een scriptingtaal die ik tot op zekere hoogte begreep en waar ik eerlijk gezegd weinig mee deed. Tot dan toe… Fast-forward, een jaar later:","text":"Ik ben inmiddels al meer dan een jaar full-time als developer aan de slag en dit bevalt me goed. Ik startte als een rookie eigenlijk, met basiskennis van .NET en PHP. Door de tijd heen ben ik me meer gaan focussen op front-end development, en hetgeen waar ik minder kaas van had gegeten, was Javascript. Een scriptingtaal die ik tot op zekere hoogte begreep en waar ik eerlijk gezegd weinig mee deed. Tot dan toe… Fast-forward, een jaar later: Ik schrijf dagelijks Javascript-code, op verschillende platformen. Vorige week nog voor m’n werkgever een stuk JS-code geschreven die met 1 simpele include voldoet aan de idiote cookiewetgeving. jQuery kent weinig grenzen, de mogelijkheden zijn eindeloos. Watertandend kijken naar de voorbeelden van ThreeJS (open ze in Google Chrome!). Ik heb mogen werken met Appcelerator Titanium, er een desktop-app in gebouwd (Inmiddels door Appcelerator als platform volledig Open Source gemaakt als: TideSDK). NodeJS leren kennen afgelopen jaar, verliefd op geworden en er al bergen tools in geschreven (Ik open binnenkort een Github om m’n code in te posten, momenteel is alles nog lokaal, op m’n Twitter toolkit na dan). Eenmaal NodeJS onder de knie, zag ik dat Titanium nu het Alloy Framework gebruikt. Mind-blowing! Het is nog even wachten op de ondersteuning van NodeJS in Android (native, command-line dus) en ook mijn telefoon wordt een server. Eindeloze mogelijkheden! Good to be a developer! Hoe word je een een goede Javascript developer? Trial and error! Trial and error! En nog meer: trial and error… Van onze fouten leren we! Leer naast basic Javascript vooral ook jQuery kennen. Voor het testen van front-end code maak ik zelf zoveel mogelijk gebruik van Firebug in Firefox en de inspector in Google Chrome. You have got to love the console! Bekijk het volgende filmpje: Dit filmpje uit 2009 legt de kracht van Javascript perfect uit. Leer het principe van MVC binnen Javascript, met voorbeelden uit EmberJS, BackboneJS etcetera. Leer de abstracte principes van Design Patterns. Probeer uiteindelijk te werken met non-blocking codes en vooral het gebruik van callbacks i.p.v. returns in functies. Deze twee principes zijn essentieel voor het schrijven van goede NodeJS-code (alsmede schone Javascript code in het algemeen). Schrijf geen enkele code twee keer! Dit is mijn principe (en zou voor jou ook moeten gelden). Je dient iets meerdere keren uit te voeren, of twee keer nét iets anders? Probeer recursieve functies te schrijven, of meer abstracte functies met parameters. Ik heb dit principe voor het eerst zoveel mogelijk proberen te benutten in het front-end Javascript design van WdkA, in opdracht van mijn werkgever.Dit zijn tot nu toe even mijn tips als het gaat om een goede Javascript developer te worden. Hoe goed ik mezelf beschouw? Goed, echter heb ik het gevoel dat er nog zoveel meer te leren is! Ik ben benieuwd naar jullie tips en links voor het leren van deze bijzonder krachtige taal!","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Need some extra motivation?","slug":"need-some-extra-motivation","date":"2012-12-23T16:45:54.000Z","updated":"2012-12-23T16:45:54.000Z","comments":true,"path":"2012/12/need-some-extra-motivation/","link":"","permalink":"http://blog.jeltelagendijk.nl/2012/12/need-some-extra-motivation/","excerpt":"Whenever I feel a bit down, or having a hard time, it always helps to find some extra motivation. It can come from anywhere, actually. People around you, a good book, or a movie. Allthough some of it is fiction, the message behind it can be pretty powerful. So, I compiled a list of a couple of Youtube videos that give me extra motivation. Love it? Share it!","text":"Whenever I feel a bit down, or having a hard time, it always helps to find some extra motivation. It can come from anywhere, actually. People around you, a good book, or a movie. Allthough some of it is fiction, the message behind it can be pretty powerful. So, I compiled a list of a couple of Youtube videos that give me extra motivation. Love it? Share it! Al Pacino’s motivational speech in the movie “Any given Sunday”This one always gets me. The movie is one of my favorites, find it here on IMDB. The scene is pretty powerful! The message behind it for me: “Never give up. If you need others to do it, use others. Be a winner, a true winner makes everybody win, including himself. Be a teamplayer” Eric Thomas - Secrets to SuccessEric Thomas is dubbed as the hip hop preacher, and he has an intense speech on becoming successful. How bad do you want it? Nick Vujicic - We only fail when we give upThe man who was born without arms or legs, and yet, he is more happy than most other people. His message is something that resonated in my mind. The limits you encounter in life, well, they are in your mind. What do you do when you fall down? You get up! Will Smith and his secrets to successGreat actor! More to come! I have a complete list of about 20 movies, a couple of books and powerful quotes. Take a look at my Pinterest page, it’s filled with motivational quotes and posters. Do you have any suggestions? Share it, comment. Love to see what you come up with.","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"Dubbeltje... eerste rij... Whatsapp","slug":"dubbeltje-eerste-rij-whatsapp","date":"2012-12-16T20:09:28.000Z","updated":"2012-12-16T20:09:28.000Z","comments":true,"path":"2012/12/dubbeltje-eerste-rij-whatsapp/","link":"","permalink":"http://blog.jeltelagendijk.nl/2012/12/dubbeltje-eerste-rij-whatsapp/","excerpt":"_Zaterdagavond… uurtje of 19u ‘s avonds. De Twitter tracker die ik eerder schreef slaat ineens op tilt. Regels vliegen voorbij en het gemiddelde ligt op 44 tweets per seconde, met het sleutelwoord “Whatsapp”. Het moge duidelijk zijn. Whatsapp lag er weer eens uit._","text":"_Zaterdagavond… uurtje of 19u ‘s avonds. De Twitter tracker die ik eerder schreef slaat ineens op tilt. Regels vliegen voorbij en het gemiddelde ligt op 44 tweets per seconde, met het sleutelwoord “Whatsapp”. Het moge duidelijk zijn. Whatsapp lag er weer eens uit._ Hilarisch om te lezen op een medium zoals Twitter, in realtime, hoe mensen over een bepaalde dienst denken. Als ik daar de Nederlandse tweets uit filter, dan zie je een trend. Kortstondige frustratie. Totale anarchie. Mensen zijn boos. “Neeeeeee. Whatsapp laat me in de steek. Ik wacht desperaat op antwoord”. Ga zo maar door. Boosheid alom, de dienst faalt wederom. Het verbaast me dat mensen een dergelijke afhankelijkheid hebben ontwikkeld voor een dienst zoals Whatsapp. (Lees: met name de jeugd). Het begint als een ‘leuke dienst’, maar verwordt al snel een ‘levensbehoefte’. Jeugd die massaal aan het Whatsappen is en compleet over de rooie heen gaat als de dienst niet werkt. De verschillende krachttermen die voorbij komen, de incidentele ‘KK’ waarmee gevloekt wordt. Ik kan me de frustratie enigszins voorstellen, de wereld vergaat echter niet als een dergelijke dienst uitvalt. Enig idee wat het kost om Whatsapp te gebruiken? Juist. Vrijwel niets. In de Apple app-store wordt hij verkocht voor minder dan €1,- , voor Android gebruikers is hij (vooralsnog) gratis. Gratis… mensen…. gratis! Of semi-gratis. Dat betekent dat het bedrijf er nul komma nul aan verdient om aan jouw, semi-sociale, digitale behoefte te voldoen. Ik heb momenteel geen flauw idee wat het jaarlijks bij het bedrijf Whatsapp kost om alle services in de lucht te houden. De oprichters houden vast aan het idee dat mensen met elkaar in verbinding blijven staan. Ze verkopen niet eens advertenties. En dat terwijl er per 24 uur maarliefst 2 miljard berichten worden gestuurd. U leest het goed: 2 miljard. Zonder dat het bedrijf er maar al te veel aan verdient, in ieder geval niet van de gebruikers. U, als consument, hoeft er niets voor te doen. Mensen, hecht niet teveel waarde aan de dienst. Ik doe het persoonlijk ook niet. Als een dienst uitvalt, en je betaalt er in zijn geheel niets voor, zeur dan ook niet dat het een keer niet werkt… Stap dan over op SMS, waarvan je weet dat het in de meeste gevallen werkt. Oh… right… dat is niet gratis… Ik mompel, onder het schrijven van code en kijkend naar mijn telefoon, iets over dubbeltjes en eerste rij… Er ligt nog een blogpost op de planken over de offline insecurity van Whatsapp, dat aantoont dat de beveiliging van de app aan de wensen over laat. Stukje offline security, wat gecombineerd kan worden met o.a. social engineering. Weet nog niet wanneer ik hem ga publiceren. Eerst maar eens het bedrijf contacteren met een paar prangende vragen…","categories":[],"tags":[{"name":"personal","slug":"personal","permalink":"http://blog.jeltelagendijk.nl/tags/personal/"}],"keywords":[]},{"title":"Cyber Awareness & Privacy","slug":"cyber-awareness-privacy","date":"2012-12-09T17:20:17.000Z","updated":"2012-12-09T17:20:17.000Z","comments":true,"path":"2012/12/cyber-awareness-privacy/","link":"","permalink":"http://blog.jeltelagendijk.nl/2012/12/cyber-awareness-privacy/","excerpt":"Ik kwam vandaag via via deze website tegen: http://cyberawareness.nctv.nl/ Ik raad een ieder aan om de korte introductiefilm te bekijken. Je krijgt hier als leek zijnde een beter beeld van de wereld van cyber security. Met name wat de implicaties zijn van sommige keuzes die wij maken, wat wij op het internet zetten.","text":"Ik kwam vandaag via via deze website tegen: http://cyberawareness.nctv.nl/ Ik raad een ieder aan om de korte introductiefilm te bekijken. Je krijgt hier als leek zijnde een beter beeld van de wereld van cyber security. Met name wat de implicaties zijn van sommige keuzes die wij maken, wat wij op het internet zetten. Als ik dit op mezelf ga betrekken, dan weet ik dat ik nogal makkelijk te Googlen ben. Nu kan ik zeggen dat ik niets te verbergen heb, dat is de grootst mogelijke bullshit die iemand je kunt vertellen. Iedereen heeft dingen te verbergen. Op het internet zijn er nu talloze voorbeelden te vinden van mensen die bijvoorbeeld ontslagen zijn door wat zij op social media zetten, zoals Facebook of Twitter. Niet zo heel gek, want velen denken er niet over na. Mijn opmerking hierover? Denk goed na voor je iets op het internet zet. Er zijn genoeg partijen die mee kunnen lezen wat jij aan het doen bent, puur vanwege het feit dat jij het op je timeline zet van Twitter en Facebook. Om te illustreren wat de kracht is van informatie op het internet, hier een voorbeeld die ik zelf heb meegemaakt. Een voorbeeldEen tijd terug was er een vermeende pedofiel actief op Twitter, althans zo leek het. Tweets richting viertienjarige meisjes die nogal sexueel getint waren. Er was een berg ophef over, en dus besloot ik zelf, ter oefening, eens onderzoek te doen naar dit persoon. Ik oefen mijn skills in Social Engineering en research dagelijks, for fun and profit. Dit leek me een goed onderwerp. Het begon met zijn account op Twitter. Zelf ben ik veel bezig met datamining en had dus al de tools klaarliggen om de laatste 3200 tweets van zijn Twitterprofiel te dumpen. (Wat nu dus een NodeJS-tool is geworden, zoals hier uitgewerkt) Hier begint de fun in research en zoeken. Tweets kun je uitsplitsen in tweets (Ik noem ze in bovenstaande tool OT: Original Tweets), retweets (RT) en replies (RP). Door alle tweets te analyseren (voor nu nog handmatig, in de toekomst wil ik dit automatiseren) kwam ik er al snel achter waar hij werkte, dit stond in een van zijn replies. Tevens hadden een aantal van zijn tweets geolocaties erin zitten. Deze kwamen overeen met de woonplaats die hij had genoemd in zijn profiel. Het mobiele telefoonnummer stond in één van zijn replies (wat sowieso een domme actie is, was snel verwijderd, echter had een andere twitteraar die al opgeslagen en geRetweet). Dat is dan dus één social media bron. We hebben een naam, telefoonnummer, geolocaties, werkadres. Dan begint voor een researcher het graafwerk door Google te gebruiken. Zoeken op naam, zoeken op plaats, zoeken op nicknames (vooral dat laatste). Dit resulteerde in een profiel van een man die op meerdere datingsites stond, waarvan tevens de voorletters bekend waren en waar, gek genoeg, ook het huisadres van op het internet stond. Binnen een zoekactie van zo’n 45 minuten heb je dan dus een profiel: Naam, voorletters en achternaam Foto’s, hoe ziet iemand eruit Woonplaats Plaatsen die bezocht zijn (geolocaties) Websites waar dit persoon op staat (Google is your best friend) Telefoonnummer (dit is zoals gezegd een toevalstreffer) + huisadres Werkadres, functie Hoe is dit afgelopen?Met een sisser. Ik werd zelf door de politie benaderd, die tekst en uitleg gaf, waarin ik mijn resultaten heb bediscussieerd. Uiteindelijk bleek het om een vergissing te gaan, hij zou gehackt zijn. De politie was er in ieder geval mee bezig en bekend, dus heb ik alle gegevens overhandigd en van me afgezet. Nooit meer iets van gehoord, het is verder correct afgehandeld door de politie. Er was in ieder geval geen misdaad gepleegd. Edit: Na wat heen en weer DM’en met mijn contactpersoon dien ik de afloop enigszins te nuanceren. In de afhandeling van bovenstaande gebeurtenis heb ik zelf geen enkele rol gespeeld. Dit is door de politie behandeld (zij waren op de hoogte van het account) en afgehandeld. We hebben alleen de resultaten van mijn zoektocht besproken, die voor een groot deel overeen kwamen en wat mij dus deed beseffen dat het koppelen van informatie van het internet, gevonden in profielen etcetera, bijzonder krachtig is. De zaak is verder afgehandeld door hen. Voor mij was bovenstaand voorbeeld een casus ter oefening. Wat leert bovenstaand verhaal?Voor iemand met een beetje technische skills is het bijzonder makkelijk om een profiel op te stellen van een persoon op het internet. Een dergelijk profiel is te gebruiken in Social Engineering, waarbij je nog meer informatie weet los te peuteren van een persoon, puur op basis van het feit dat je al zoveel weet. Bent u daarmee in gevaar? Nee, natuurlijk niet. Het zet je echter wel aan het denken. Welke informatie die ik op het internet zet, kan gekoppeld worden aan andere informatie die ik achterlaat? “Hmmmm, ik heb voor dit account als geheime vraag: ‘wat is de naam van mijn kat?’. Die heb ik eerlijk beantwoord. Ik ben echter even vergeten dat ik mijn poes Miauw uitgebreid vermeld op m’n Facebook” Heeft u wat te verbergen? Denk erover na wat u op het internet zet!Nog een leuke documentaire zien over privacy? Ik raad een ieder aan om ‘Panopticon‘ te kijken, van journalist Peter Vlemmix. Deze zet je aan het denken wat privacy (en het gebrek daarvan) nu inhoudt in Nederland.","categories":[],"tags":[{"name":"cybersecurity","slug":"cybersecurity","permalink":"http://blog.jeltelagendijk.nl/tags/cybersecurity/"}],"keywords":[]},{"title":"Twitter toolkit in NodeJS","slug":"twitter-toolkit-in-nodejs","date":"2012-12-09T03:24:35.000Z","updated":"2012-12-09T03:24:35.000Z","comments":true,"path":"2012/12/twitter-toolkit-in-nodejs/","link":"","permalink":"http://blog.jeltelagendijk.nl/2012/12/twitter-toolkit-in-nodejs/","excerpt":"Edit (10-05-2014) : Decided to make this one open source, on Github I love NodeJS. It has been a blast, learning new stuff every day I work with this great platform. It is currently used in a couple of major websites and will continue to grow to one of the biggest frameworks, if you ask me.","text":"Edit (10-05-2014) : Decided to make this one open source, on Github I love NodeJS. It has been a blast, learning new stuff every day I work with this great platform. It is currently used in a couple of major websites and will continue to grow to one of the biggest frameworks, if you ask me. I like Twitter and I love datamining, so I thought it would be fun to share some things I have been working on. This time, it is a Twitter toolkit. Basically, what I wanted was a toolkit that provides me with realtime data, or aggregated data on a user. The sky is the limit, I already have plans on writing this into a full blown server app that will do the analysis, fully automated. Aggregating Twitter data from a user, analyzing all the keywords and links provides you with a more detailed profile on a person. Sounds like a fun project? It’s part of social engineering and profiling, and I like to do these kind of things. So here it is, my app.js. It could be more abstract, creating multiple includes and requires. For now, it is just a work in progress, I like to have it all in one single file. A big chuck of this code was rewritten by Jasper, I reused his setup. What can you do with it? Searching for keywords ( #node app.js search &lt;keywords&gt; ) of from and to a user ( #node app.js search from:@user @user ) Looking at a stream of data, filtered on keywords ( #node app.js stream &lt;keywords&gt; ) Lookup a user ( #node app.js lookup &lt;user&gt; ) Check trends ( #node app.js trends 1 ), for now I included the woeid from the Netherlands as option 2. (A WoeID = Where On Earth ID, created by Yahoo. I found the id using this tool) Dump the tweets from a user ( #node app.js dump &lt;user&gt; ) Dumping tweets is fun. You could put them into a database and analyse it. Twitter API allows you to dump approximately 3200 tweets. In most cases it will not be this amount of tweets, but a lot less (because tweets get deleted, etcetera, if I recall this right). What do you need? NodeJS, obviously Twitter module from Tolga Tezel (ttezel @ Github), that can be found here. Install it: #npm install twit A Twitter app. Create one here, and insert the keys in the app.js (on line 24-27) Credits and mentions Credits to @JvdMeulen, he created a big chuck of this code. Great job, Jasper! Hope to see more of your work at logt.nu This little piece of code inspired @Legosteentje to create a realtime ‘sneeuw’-tracker, using NodeJS and SocketIO. Can be found here. The code:Edit (10-05-2014): Code is removed. Revised version can be found here: https://github.com/j3lte/twitter-toolkit/blob/master/app.js Have fun with it! If you have any questions, feel free to ask! I will provide a Github link when my code is more advanced. Hit me up on Twitter if you can help me creating a better code! More will follow in the near future….","categories":[],"tags":[{"name":"dev","slug":"dev","permalink":"http://blog.jeltelagendijk.nl/tags/dev/"}],"keywords":[]},{"title":"Even wachten... pizza!","slug":"even-wachten-pizza","date":"2012-12-08T18:32:00.000Z","updated":"2012-12-08T18:32:00.000Z","comments":true,"path":"2012/12/even-wachten-pizza/","link":"","permalink":"http://blog.jeltelagendijk.nl/2012/12/even-wachten-pizza/","excerpt":"Het is alweer even geleden dat ik berichtte over New York Pizza, vond het nu tijd om hier maar eens op mijn eigen website over te berichten. Een privacy issue waar ze maar niets aan willen doen. Zelf contact gezocht met @brenno, hij kreeg echter n.a.v. zijn column een standaard antwoord van ze, net als ik: “Ja we weten dat de site verouderd is, we gaan er wat vaart achter zetten om de boel op orde te krijgen”. Dit antwoord datteert alweer van een paar weken geleden en er is nog steeds niets aan gedaan.","text":"Het is alweer even geleden dat ik berichtte over New York Pizza, vond het nu tijd om hier maar eens op mijn eigen website over te berichten. Een privacy issue waar ze maar niets aan willen doen. Zelf contact gezocht met @brenno, hij kreeg echter n.a.v. zijn column een standaard antwoord van ze, net als ik: “Ja we weten dat de site verouderd is, we gaan er wat vaart achter zetten om de boel op orde te krijgen”. Dit antwoord datteert alweer van een paar weken geleden en er is nog steeds niets aan gedaan. Wat is het probleem?Op de website van dit bedrijf kun je als klant ‘inloggen’, zoals zij dat noemen. Als je als klant ingelogd bent, dan kun je dus met jouw gegevens makkelijker een pizza bestellen. Oftewel, je adresgegevens staan al ingevuld. Nu ben ik een fan van pizza’s laten bezorgen (gezien de gezondheid en portemonnee doe ik dat gelukkig sporadisch), ik was vroeger een grote klant van Thuisbezorgd.nl Wat verstaat New York Pizza dan onder ‘inloggen’?Het gebruikmaken van je e-mailadres en telefoonnummer. Perfect. Ware het niet dat deze informatie makkelijk op te zoeken is en dan dus een privacy issue tot gevolg heeft. Waarom? Ieder persoon dat de combinatie van het telefoonnummer en e-mailadres kan opzoeken, kan dus de exacte adresgegevens opzoeken van een klant. Freaky, right? Is dit vreemd? Ja. Zoals Brenno ook al stelde in zijn column, gaat het hele principe wat betreft ‘inloggen’ om het feit dat jij iets weet, dat anderen niet weten. In dit geval is dat dus niet zo. Voorlopig geen pizza’s meer voor mij….","categories":[],"tags":[{"name":"cybersecurity","slug":"cybersecurity","permalink":"http://blog.jeltelagendijk.nl/tags/cybersecurity/"}],"keywords":[]}]}